[
    {
        "date": "2025-01-22",
        "url": "https://github.com/beancount/beancount",
        "title": "Beancount",
        "description": "Beancount is a [double-entry bookkeeping](https://en.wikipedia.org/wiki/Double-entry_bookkeeping) computer language that lets you define financial transaction records in a text file, generate reports from it, visualize trends, and much more. I've never really been happy with how I (loosely) keep track of my finances via spreadsheets; every attempt always seemed to have too much friction to actually use. I somehow recently came across Beancount and friends, such as [Ledger](https://github.com/ledger/ledger), and was immediately intrigued by the fact that (1) it's based purely on text files, (2) there's a CLI tool, and (3) it's open source. The fact that everything is stored in a text file just means that I'm no longer tied to a particular application just to keep track of my finances. Separately, I basically live in the terminal, so the fact that it's a CLI tool alone convinced me. I'm excited to learn more about this!"
        ,
        "tags": ["cli", "finance"]
    },
    {
        "date": "2025-01-15",
        "url": "https://keepachangelog.com/en/1.1.0/",
        "title": "Keep a Changelog",
        "description": "As someone who uses Git both professionally and in my personal projects, I'd say that I'm pretty used to the idea of documenting changes, at least via commits. However, I think I generally could do a better job of documenting changes in a more user-friendly way for many of the reasons that are mentioned in this article. (I've never been much of a journaler, go figure) Anyway, I've been trying it out for this project of building this website/blog, and I do find it very helpful for reminding me of when I did what in a user-friendly way, e.g., without having to go into my commit history. However, it also has been a great way of reminding me of how consistent incremental work pays off. I will eventually link my changelog to the version tag at the bottom of this page, by the way!",
        "tags": ["programming", "documentation"]
    },
    {
        "date": "2025-01-10",
        "url": "https://kristerw.github.io/2021/10/19/fast-math/",
        "title": "Optimizations enabled by -ffast-math",
        "description": "At some point, I needed to better understand what `-ffast-math` was enabling for me, and I found this article particularly useful.",
        "tags": ["programming", "optimization"]
    },
    {
        "date": "2025-01-05",
        "url": "https://www.swyx.io/learn-in-public",
        "title": "Learn in Public",
        "description": "This is a good reminder to myself to not be scared about putting myself out there. One of my passions is teaching, or rather, being able to help and inspire others in their learning, and I very much agree with the ideas in the blog post. To be able to impact more people, I must be willing to share what I've learned. I think many people, myself included, love seeing the process by which something is achieved; sharing what I'm learning is exactly that.",
        "tags": []
    },
    {
        "date": "2025-01-03",
        "url": "https://github.com/paperless-ngx/paperless-ngx",
        "title": "Paperless-ngx - A self-hostable archive for physical documents",
        "description": "I just bought a cheap machine to use as a homelab, so I'm gearing up by collecting various open-source self-hostable software that I may find useful. Being able to digitize all of my physical documents, like medical bills, car repairs, insurance, etc., would be super convenient in terms of both information-retrieval and safe-keeping. I'm excited to try this one out.",
        "tags": ["github", "self-hosted"]
    },
    {
        "date": "2025-01-02",
        "url": "https://github.com/hoarder-app/hoarder",
        "title": "Hoarder - A self-hostable bookmark-everything app",
        "description": "I've been searching for ways to unify my bookmarks across all my devices, and this seems to be a pretty promising solution. In fact, this very goal of wanting to unify where I save my links/bookmarks for easy retrieval is why I decided to build this webpage for saving/sharing links. I also have been wanting to learn how to self-host services - screw relying on SAAS. This seems easy enough, and also extremely useful for me.",
        "tags": ["github", "self-hosted"]
    },
    {
        "date": "2024-12-30",
        "url": "https://www.nerdfonts.com/cheat-sheet",
        "title": "Nerd Fonts Cheat Sheet",
        "description": "I really like the icons provided here. At the time of writing this, I use a few icons in my tmux and neovim setups.",
        "tags": ["design", "fonts"]
    },
    {
        "date": "2024-12-29",
        "url": "https://www.youtube.com/watch?v=oDQlq5QlfEU",
        "title": "pH-1 '인생영화 (Feat. 정지소)' Official MV",
        "description": "I really like pH-1, and this is a great song. But separately, I really like the interior of the house they shot this MV at.",
        "tags": ["music", "korean", "interior-design"]
    },
    {
        "date": "2024-12-29",
        "url": "https://support.apple.com/en-us/102600",
        "title": "How to replace the battery in your AirTag",
        "description": "Apparently replacing the battery in your AirTag is super easy. tldr: it uses a [CR2032 battery](https://www.amazon.com/Amazon-Basics-CR2032-Compatible-Mercury-Free/dp/B0787K2XWZ/ref=sr_1_1_ffob_sspa?sr=8-1-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&psc=1).",
        "tags": ["apple", "diy"]
    }
]
